USE SpaceObjects;

INSERT INTO [dbo].[planet_type]
VALUES ('Земной тип', 'Планеты, похожие на Землю, в основе своей состоящие из горных пород');

INSERT INTO [dbo].[planet_type] ([name], [description])
VALUES
	('Газовый гигант', 'Планеты, в значительной степени состоящие из газа, и значительно более массивные, чем планеты земной группы'),
	('Ледяной гигант', 'Это подкласс газовых гигантов, которых отличает от других газовых гигантов «небольшая» масса (14-17 земных) наравне со значительно большими пропорциями горных пород и льда'),
	('Карлик', 'Имеет достаточную массу для того, чтобы, в отличие от малых тел Солнечной системы, под действием сил гравитации поддерживать близкую к сферической форму');

INSERT INTO [dbo].[star_type]
VALUES
	('Тип O'),
	('Тип B'),
	('Тип A'),
	('Тип F'),
	('Тип G'),
	('Тип K'),
	('Тип M');

INSERT INTO [dbo].[star] ([name], [id_star_type], [diameter], [mass], [magnitude], [temperature], [date_discovery])
VALUES 
	('RS 8476-4-3-219-39', 2, 5368311.50, 8.9432, -38.71, 20407, '01-01-1970'),
	('RS 0-6-145117-920-226-0-0-157', 4, 241066500000, 17.685, -19.706, 7736, '01-01-1970'),
	('RS 0-6-173202-196-0-0-0-2', 1, 56472932.33, 46.889, 5.84, 3416.9, '01-01-1970');

INSERT INTO [dbo].[planet] ([id_planet_type], [id_star], [name], [diameter], [mass], [surface_temperature], [date_discovery])
VALUES
	(1, 3, 'RS 0-6-173202-196-0-0-0-2 1', 6138.5, 0.15, 928.1, '02-01-2001'),
	(1, 3, 'RS 0-6-173202-196-0-0-0-2 2', 49238.2, 322.4, 253, '10-12-2000'),
	(2, 2, 'RS 0-6-145117-920-226-0-0-157 4', 62391.9, 415.6, 198, '02-07-1998'),
	(2, 2, 'RS 0-6-145117-920-226-0-0-157 6', 7589.5, 522.1, 334, '09-19-1995'),
	(3, 2, 'RS 8476-4-3-219-39 1', 4319.6, 291.8, 188, '05-14-2002'),
	(4, 1, 'RS 8476-4-3-219-39 3', 55486.7, 376.9, 276, '03-28-1999');

INSERT INTO [dbo].[star_has_absolute_magnitude] ([id_star], [absolute_magnitude], [date_start], [date_end])
VALUES
    (2, 6.7, '1970-01-01', '1997-10-22'),
    (3, 6.2, '1970-01-01', '1997-10-22'),
    (3, 9.1, '1997-10-22', '2004-07-09'),
    (3, 12.4, '2004-07-09', '2011-12-18'),
    (3, 15.8, '2011-12-18', '2018-05-26'),
    (1, 19.1, '1918-05-26', '1925-11-02'),
    (1, 22.5, '1925-11-02', '1933-04-10'),
    (1, 25.8, '1933-04-10', '1940-09-18'),
    (1, 29.2, '1940-09-18', '1948-02-26'),
    (1, 32.5, '1948-02-26', '1955-07-06'),
    (1, 35.9, '1955-07-06', '1962-12-15');
